#!bin/sh

# 打印停车场布局，及边权信息

# 原始地图路径
PATH_MAP=./map/map2

a=(0)
i=1
while read line
do
	a[$i]=`echo $line | cut -d ' ' -f 2`
	((i++))
done < node_adj.txt

if [ "$1" == '-edge' ]; then
	echo "边权信息:"
	echo "A1-B1: ${a[1]}"
	echo "A1-A2: ${a[2]}"
	echo "A2-B4: ${a[3]}"
	echo "A1-B2: ${a[4]}"
	echo "A2-B3: ${a[5]}"
	echo "B1-B2: ${a[6]}"
	echo "B2-B3: ${a[7]}"
	echo "B3-B4: ${a[8]}"
	echo "B1-C1: ${a[9]}"
	echo "B2-C2: ${a[10]}"
	echo "B3-C3: ${a[11]}"
	echo "B4-C4: ${a[12]}"
	echo "C1-C2: ${a[13]}"
	echo "C2-C3: ${a[14]}"
	echo "C3-C4: ${a[15]}"
	echo "C1-D1: ${a[16]}"
	echo "C2-D2: ${a[17]}"
	echo "C3-D3: ${a[18]}"
	echo "C4-D4: ${a[19]}"
	echo "D1-D2: ${a[20]}"
	echo "D2-D3: ${a[21]}"
	echo "D3-D4: ${a[22]}"
fi

echo "停车场布局图:"
sed "s/01             02            03/${a[1]}             ${a[2]}              ${a[3]}/" ${PATH_MAP} |
sed "s/04 |        | |05/${a[4]} |        | |${a[5]}/" |
sed "s/06     |       07     |       08/${a[6]}     |       ${a[7]}     |       ${a[8]}/" |
sed "s/09 |________| |10 |________| |11 |________| |12/${a[9]} |________| |${a[10]} |________| |${a[11]} |________| |${a[12]}/" |
sed "s/13     |       14     |       15     |/${a[13]}     |       ${a[14]}     |       ${a[15]}     |/" |
sed "s/16 |________| |17 |________| |18 |________| |19/${a[16]} |________| |${a[17]} |________| |${a[18]} |________| |${a[19]}/" |
sed "s/20     |       21     |       22     |/${a[20]}     |       ${a[21]}     |       ${a[22]}     |/" 
